{"class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.2.4", "config": {"name": "sequential_1", "layers": [{"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "activation": "relu", "batch_input_shape": [null, 64, 64, 3], "name": "conv2d_1", "use_bias": true, "data_format": "channels_last", "dtype": "float32", "bias_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "trainable": true, "kernel_constraint": null, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "filters": 32, "bias_regularizer": null}}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "epsilon": 0.001, "name": "batch_normalization_1", "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "trainable": true, "axis": -1, "beta_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "trainable": true, "name": "max_pooling2d_1", "strides": [2, 2], "data_format": "channels_last", "padding": "valid"}}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "activation": "relu", "batch_input_shape": [null, 64, 64, 3], "name": "conv2d_2", "use_bias": true, "data_format": "channels_last", "dtype": "float32", "bias_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "trainable": true, "kernel_constraint": null, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "filters": 32, "bias_regularizer": null}}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "epsilon": 0.001, "name": "batch_normalization_2", "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "trainable": true, "axis": -1, "beta_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "trainable": true, "name": "max_pooling2d_2", "strides": [2, 2], "data_format": "channels_last", "padding": "valid"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "data_format": "channels_last", "trainable": true}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "activation": "relu", "name": "dense_1", "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "trainable": true, "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "units": 128}}, {"class_name": "Dropout", "config": {"noise_shape": null, "name": "dropout_1", "rate": 0.2, "seed": null, "trainable": true}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "activation": "relu", "name": "dense_2", "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "trainable": true, "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "units": 128}}, {"class_name": "Dropout", "config": {"noise_shape": null, "name": "dropout_2", "rate": 0.2, "seed": null, "trainable": true}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "activation": "sigmoid", "name": "dense_3", "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "trainable": true, "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "units": 1}}]}}