{"class_name": "Sequential", "keras_version": "2.2.4", "backend": "tensorflow", "config": {"name": "sequential_11", "layers": [{"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "seed": null, "stddev": 0.05}}, "bias_regularizer": null, "activity_regularizer": null, "use_bias": true, "units": 8, "name": "dense_31", "dtype": "float32", "trainable": true, "kernel_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "batch_input_shape": [null, 30], "activation": "relu"}}, {"class_name": "Dropout", "config": {"name": "dropout_21", "trainable": true, "seed": null, "noise_shape": null, "rate": 0.2}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "seed": null, "stddev": 0.05}}, "activity_regularizer": null, "use_bias": true, "units": 8, "bias_constraint": null, "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_32", "activation": "relu"}}, {"class_name": "Dropout", "config": {"name": "dropout_22", "trainable": true, "seed": null, "noise_shape": null, "rate": 0.2}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "activity_regularizer": null, "use_bias": true, "units": 1, "bias_constraint": null, "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_33", "activation": "sigmoid"}}]}}